[
  {
    "Id": 1,
    "ProductCode": "D9044254601711",
    "ProductName": "Belisar Moonphase Chronograph Watch",
    "Description": "Classic watchmaking excellence from Union Glashutte, this Belisar Moonphase features a finely decorated self winding automatic chronograph movement visible through the exhibition case back, featuring an annual calendar, 24 hour dial and moonphase as well as 60 hour power reserve, displayed in an elegant, sophisticated fashion using day pointer and dial windows, on a pure white dial with crisp applied rose numerals and blued hands.",
    "Price": 79.99,
    "Quantity": 100,
    "BasketCount": 0,
    "TotalPrice": 0.0,
    "Category": "Muhle Glashutte",
    "InBasket": false,
    "Image": "https://d1rkccsb0jf1bk.cloudfront.net/products/100013507/main/medium/D9044254601701_5357.jpg"
  },
  {
    "Id": 2,
    "ProductCode": "M0A10485",
    "ProductName": "Baume Classima Watch",
    "Description": "Chronograph movement visible through the exhibition case back, featuring an annual calendar, 24 hour dial and moonphase as well as 60 hour power reserve, displayed in an elegant, sophisticated fashion using day pointer and dial windows, on a pure white dial with crisp applied rose numerals and blued hands.",
    "Price": 89.99,
    "Quantity": 0,
    "BasketCount": 0,
    "TotalPrice": 0.0,
    "Category": "Muhle Glashutte",
    "InBasket": false,
    "Image": "https://d1rkccsb0jf1bk.cloudfront.net/products/100032434/main/medium/M0A104852.jpg"
  },
  {
    "Id": 3,
    "ProductCode": "DC3026A-SC-BE",
    "ProductName": "Hydrocarbon NEDU Titanium Watch ",
    "Description": "Decorated self winding automatic chronograph movement visible through the exhibition case back, featuring an annual calendar, 24 hour dial and moonphase as well as 60 hour power reserve, displayed in an elegant, sophisticated fashion using day pointer and dial windows, on a pure white dial with crisp applied rose numerals and blued hands.",
    "Price": 99.99,
    "Quantity": 99,
    "BasketCount": 0,
    "TotalPrice": 0.0,
    "Category": "Muhle Glashutte",
    "InBasket": false,
    "Image": "https://d1rkccsb0jf1bk.cloudfront.net/products/99984316/main/medium/dc3026a-sc-be-1437038541-7924.jpg"
  },
  {
    "Id": 4,
    "ProductCode": "M1-41-33-MB",
    "ProductName": "Glashutte S.A.R. Flieger Watch ",
    "Description": "Union Glashutte, this Belisar Moonphase features a finely decorated self winding automatic chronograph movement visible through the exhibition case back, featuring an annual calendar, 24 hour dial and moonphase as well as 60 hour power reserve, displayed in an elegant, Belisar Moonphase features a finely decorated self winding automatic chronograph sophisticated fashion using day pointer and dial windows, on a pure white dial with crisp applied rose numerals and blued hands.",
    "Price": 49.99,
    "Quantity": 100,
    "BasketCount": 0,
    "TotalPrice": 0.0,
    "Category": "Muhle Glashutte",
    "InBasket": false,
    "Image": "https://d1rkccsb0jf1bk.cloudfront.net/products/99968391/main/medium/m1-41-33-mb_600x938-1397146231-58.jpg"
  },
  {
    "Id": 5,
    "ProductCode": "M1-29-63-NB",
    "ProductName": "Teutonia Sport I Watch ",
    "Description": "Winding automatic chronograph movement visible through the exhibition case back, featuring an annual calendar, 24 hour dial and moonphase as well as 60 hour power reserve, displayed in an elegant, sophisticated fashion using day pointer and dial windows, on a pure white dial with crisp applied rose numerals and blued hands.",
    "Price": 79.99,
    "Quantity": 100,
    "BasketCount": 0,
    "TotalPrice": 0.0,
    "Category": "Muhle Glashutte",
    "InBasket": false,
    "Image": "https://d1rkccsb0jf1bk.cloudfront.net/products/100014922/main/medium/m1-29-63-nb-1499097810-7770.jpg"
  },
  {
    "Id": 6,
    "ProductCode": "M1-30-95-MB",
    "ProductName": "Teutonia II Watch ",
    "Description": "Movement visible through the exhibition case back, featuring an annual calendar, 24 hour dial and moonphase as well as 60 hour power reserve, displayed in an elegant, sophisticated fashion using day pointer and dial windows, on a pure white dial with crisp applied rose numerals and blued hands.",
    "Price": 99.99,
    "Quantity": 100,
    "BasketCount": 0,
    "TotalPrice": 0.0,
    "Category": "Muhle Glashutte",
    "InBasket": false,
    "Image": "https://d1rkccsb0jf1bk.cloudfront.net/products/99968372/main/medium/m1-30-95-mb_600x938_01-1397145410-4652.jpg"
  },
  {
    "Id": 7,
    "ProductCode": "M1-30-92-MB",
    "ProductName": "Teutonia I Watch ",
    "Description": "Moonphase features a finely decorated self winding automatic  the exhibition case back, featuring an annual calendar, 24 hour dial and moonphase as well as 60 hour power reserve, displayed in an elegant, sophisticated fashion using day pointer and dial windows, on a pure white dial with crisp applied rose numerals and blued hands.",
    "Price": 129.99,
    "Quantity": 100,
    "BasketCount": 0,
    "TotalPrice": 0.0,
    "Category": "Muhle Glashutte",
    "InBasket": false,
    "Image": "https://d1rkccsb0jf1bk.cloudfront.net/products/99983840/main/medium/muehle-glashuette_teutonia_ii_chronograph_m1-30-92-mb-1435580210-48.jpg"
  },
  {
    "Id": 8,
    "ProductCode": "M1-41-33-KB",
    "ProductName": "SAR Fleiger Watch ",
    "Description": "Belisar Moonphase features a finely decorated self winding automatic chronograph movement visible through the exhibition case back, featuring an annual calendar, 24 hour dial and moonphase as well as 60 hour power reserve, displayed in an elegant, sophisticated fashion using day pointer and dial windows, on a pure white dial with crisp applied rose numerals and blued hands.",
    "Price": 99.90,
    "Quantity": 100,
    "BasketCount": 0,
    "TotalPrice": 0.0,
    "Category": "Muhle Glashutte",
    "InBasket": false,
    "Image": "https://d1rkccsb0jf1bk.cloudfront.net/products/99953891/main/medium/m1-41-33-kb_600x938-1342801648-9226.jpg"
  },
  {
    "Id": 9,
    "ProductCode": "M1-30-95-LB",
    "ProductName": "Glashutte Teutonia II Watch ",
    "Description": "Windows, on a pure white dial with crisp applied rose numerals and blued hands, this Belisar Moonphase features a finely decorated self winding automatic chronograph movement visible through the exhibition case back, featuring an annual calendar, 24 hour dial and moonphase as well as 60 hour power reserve, displayed in an elegant, sophisticated fashion using day pointer and dial.",
    "Price": 99.99,
    "Quantity": 100,
    "BasketCount": 0,
    "TotalPrice": 0.0,
    "Category": "Muhle Glashutte",
    "InBasket": false,
    "Image": "https://d1rkccsb0jf1bk.cloudfront.net/products/99953887/main/medium/m1-30-95-lb_600x938_01-1342801622-4748.jpg"
  }
]